{
  "name": "Colin Wren",
  "info": {
    "label": "Test Automation Engineer at BJSS",
    "image": "",
    "brief": "Software Development Engineer in Test interested in Health tech, Augmented Reality and Open Source software. Very interested in Lean and Agile & building and working in great teams that build products that deliver the most value to the user through continuously improving quality and processes."
  },
  "contact": {
    "email": "",
    "phone": "",
    "website": "colinwren.is/awesome"
  },
  "meta": {
    "format": "FRESH@^1.0.0-beta",
    "modified": "2019-01-01T22:01:21.152Z"
  },
  "location": {
    "city": "",
    "region": "",
    "country": "",
    "code": "LS9 8AY",
    "address": ""
  },
  "employment": {
    "history": [
      {
        "position": "Test Automation Engineer",
        "employer": "BJSS",
        "summary": "Initially working for a international gambling sector client to launch their New Jersey offering in time to meet the change in New Jersey state law that allowed sports book betting to take place.   Then moving to Test Automation as they grow their global platform for new markets.  Technologies used: - JavaScript (ES6, EJS, Node) - React & Jest - PHP (Laravel, Lumen, PHPUnit) - Webdriver.io (WDIO) - webdriver-selenium - Docker - Gitlab & Gitlab Runners - Jenkins - Postman (and newman)",
        "current": true,
        "start": "2018-02-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Software Developer - LiveObs",
        "employer": "BJSS",
        "summary": "Leading a team of three amazing people to create high quality software with a focus on delivering value to our users via Lean and Agile methods.   Working with Python and JavaScript to help shape the way that hospitals run wards and care for patients, while ensuring the product met the needs of the user by using validated learning techniques, TDD and BDD.  Technology used - Odoo - Python - Selenium - Locust - JavaScript (CoffeeScript, jQuery, Karma, Jasmine) - Docker - GoCD - Sketch & Marvel (for UX mockups) - Github - Travis - Codacy",
        "start": "2016-04-01",
        "end": "2018-02-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Software Development Manager",
        "employer": "Neova Health",
        "summary": "Leading a team of eight amazing people to create high quality software with a focus on delivering value to our users via Lean and Agile methods. Co-ordinated the adoption of Scrum and Continuous delivery practices as well helped to build a culture of validated learning and knowledge sharing within the company. Conducted staff performance reviews, appraisals and one-to-ones as well as other managerial duties.",
        "start": "2015-04-01",
        "end": "2016-03-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Frontend Developer",
        "employer": "Neova Health",
        "summary": "Creating frontend for OpenERP/Odoo based electronic observation platform using Python, Coffeescript, D3.js and LESS. Also have some fun using Ansible, Bash, Scala and PhantomJS.",
        "start": "2014-07-01",
        "end": "2015-04-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Director",
        "employer": "Datarrgh Apps",
        "summary": "A side project that will encompass all work I do outside of my day job at Neova Health.",
        "start": "2013-12-01",
        "end": "2016-01-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Front End Developer",
        "employer": "Tactix4",
        "summary": "I make dynamic web and mobile interfaces using HTML5, CSS (LESS), Javascript and Play! framework in Scala for Miocare devices that run Tactix4's products utilising an open source development environment running Linux.",
        "start": "2013-11-01",
        "end": "2014-07-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "App developer",
        "employer": "Self Employed",
        "summary": "Working with NHS Somerset, the New Economics Foundation and AttDigital I was commissioned to design and develop an app for Android and iOS that helps user to keep track of their wellbeing and helps them set activities that will increase it.  The app was built using Apache Cordova (formerly PhoneGap) to give the app an even playing field across both platforms as due to the project timeframe and also that I was still working my 9-5 job there was a very limited amount of time. The app runs on HTML, CSS3 and JavaScript using plugins to use the devices local storage, SQLite database and to fire the local notifications which remind the user to do the activities they set.  While doing this project I increased my knowledge of PhoneGap / Cordova and updated a number of widely used plugins to use the newest version of Cordova.  Now doing my app / web work under the Datarrgh Apps name",
        "start": "2013-05-01",
        "end": "2013-12-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Joint Chair and Technology Specialist",
        "employer": "nhssm",
        "summary": "Organising weekly #nhssm twitter chat, chairing the chats and managing the nhssm Twitter account. Creating the nhssm blog and the technical aspects of running nhssm. Sharing my knowledge of the technical side of social media with the nhssm group and provide easy to understand tutorials on how to do advanced social media tasks.",
        "start": "2010-08-01",
        "end": "2016-01-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "New Media Officer",
        "employer": "St George's Healthcare NHS Trust",
        "summary": "I worked as a Web Developer and Designer in the Communications Unit at St George's Healthcare NHS Trust. As well as maintaining the Trust's website and developing new features for the website I also managed the Trust's Social Media accounts.   My work with St George's Healthcare's Social Media accounts has been mentioned in the Financial Times and the Guardian Healthcare Network blog. I also lead a project that saw St George's Hospital become the first UK hospital to offer interior maps on Google Maps as well as redesigned and redeveloped the St George's Healthcare website.",
        "start": "2010-05-01",
        "end": "2013-11-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Web Designer and Developer",
        "employer": "Moya Hogarth",
        "summary": "I made a website for a local artist, Moya Hogarth. I was tasked with taking her existing web site and making it more dynamic and existing while keeping it elegant at the same time. I worked closely with Moya to create a website that met her needs. From Design to completion the website took 2 months, I was a University at the time so I wasn't able to spend much time on development.",
        "start": "2008-02-01",
        "end": "2008-03-01",
        "url": "",
        "keywords": [],
        "highlights": []
      },
      {
        "position": "Bar Associate",
        "employer": "JD Wetherspoon",
        "summary": "I worked on the Bar at the Edward Rayne in Raynes Park. Working in a pub allowed me to learn how to read people so I can create an instant rapport with them. Something that has helped immensely in later life.",
        "start": "2007-02-01",
        "end": "2010-04-01",
        "url": "",
        "keywords": [],
        "highlights": []
      }
    ]
  },
  "education": {
    "level": "",
    "history": [
      {
        "institution": "",
        "start": "2006-01-01",
        "end": "2009-01-01",
        "grade": "",
        "curriculum": [],
        "summary": "",
        "area": "",
        "studyType": "BA (Hons)"
      },
      {
        "institution": "",
        "start": "2004-01-01",
        "end": "2006-01-01",
        "grade": "",
        "curriculum": [],
        "summary": "",
        "area": "",
        "studyType": "A Levels"
      },
      {
        "institution": "Bishopsford Community School",
        "start": "2000-01-01",
        "end": "2004-01-01",
        "grade": "",
        "curriculum": [],
        "summary": "",
        "area": "",
        "studyType": ""
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Accessibility",
        "level": "",
        "skills": []
      },
      {
        "name": "Social Media",
        "level": "",
        "skills": []
      },
      {
        "name": "SEO",
        "level": "",
        "skills": []
      },
      {
        "name": "Project Planning",
        "level": "",
        "skills": []
      },
      {
        "name": "PHP",
        "level": "",
        "skills": []
      },
      {
        "name": "iPhone Application Development",
        "level": "",
        "skills": []
      },
      {
        "name": "Webservice design",
        "level": "",
        "skills": []
      },
      {
        "name": "Web Content Management",
        "level": "",
        "skills": []
      },
      {
        "name": "Healthcare",
        "level": "",
        "skills": []
      },
      {
        "name": "Graphic Design",
        "level": "",
        "skills": []
      },
      {
        "name": "Twitter",
        "level": "",
        "skills": []
      },
      {
        "name": "Mobile Phone Apps",
        "level": "",
        "skills": []
      },
      {
        "name": "Social Networking",
        "level": "",
        "skills": []
      },
      {
        "name": "HTML 5",
        "level": "",
        "skills": []
      },
      {
        "name": "JavaScript",
        "level": "",
        "skills": []
      },
      {
        "name": "HTML",
        "level": "",
        "skills": []
      },
      {
        "name": "HTML5",
        "level": "",
        "skills": []
      },
      {
        "name": "Blogging",
        "level": "",
        "skills": []
      },
      {
        "name": "Change Management",
        "level": "",
        "skills": []
      },
      {
        "name": "Content Management",
        "level": "",
        "skills": []
      },
      {
        "name": "Web Development",
        "level": "",
        "skills": []
      }
    ]
  },
  "writing": [
    {
      "title": "Social networking for nurses",
      "publisher": "Nursing in Practice",
      "url": "http://content.yudu.com/Library/A1w44i/NursinginPracticeMar/resources/29.htm",
      "date": "2012-03-20",
      "summary": "Article covers the use of social media by nurses, the available networks and how it can improve healthcare"
    },
    {
      "title": "An issue of confidence: social media for nurses and midwives",
      "publisher": "Guardian Healthcare Network",
      "url": "http://www.guardian.co.uk/healthcare-network/2012/feb/21/issue-confidence-social-media-training",
      "date": "2012-02-21",
      "summary": "Confidentiality is key when dealing with patients on digital networks and formal training should be required, explains Colin Wren"
    }
  ],
  "social": [
    {
      "label": "Twitter",
      "network": "Twitter",
      "url": "https://twitter.com/colinwren",
      "user": "colinwren"
    }
  ],
  "testimonials": [
    {
      "name": "Andy Bossom - University for the Creative Arts",
      "flavor": "professional",
      "quote": "I can heartily recommend Colin. He is a conscientious, heard working, lateral thinking creative individual who would bring a lot to any project.",
      "private": false
    },
    {
      "name": "Alex Talbott - Yeovil Hospital NHS Foundation",
      "flavor": "professional",
      "quote": "I have worked with Colin on NHS Social Media, #nhssm (http://nhssm.org.uk), for the past 15 months. I can safely say that I am still yet to meet someone with a wider breadth and depth of IT and social media knowledge. Colin’s skills in programming across a host of different computer languages and ability to push the boundaries of what is already out there are only put in the shade by his ability to patiently and extremely clearly explain, in plain English, the impact IT and social media can have on all of us.     In my experience Colin is extremely capable in working with: php, HTML5, CSS, and the APIs of Twitter, Facebook, Google Maps and Foursquare and more.     Colin’s work on the #nhssm blog and chats are an example of what he is capable of in his spare time. His work on the St George’s NHS Trust annual report (see: http://www.stgeorges.nhs.uk/annual/default.asp) is groundbreaking and has raised the bar for all NHS Trusts across the UK.",
      "private": false
    },
    {
      "name": "Srdan Srepfler - Addison Global - The Creators of MoPlay",
      "flavor": "professional",
      "quote": "Colin is a jack of all trades, development, testing, in any language. Always switched on, attentive to details and the bigger picture. If there's a higher cause, even better!",
      "private": false
    },
    {
      "name": "Monica Barten - Standard Chartered Bank",
      "flavor": "professional",
      "quote": "If you need someone who understands social media and is at the forefront of the industry, Colin is someone you can rely on.  He understands how it fits into the marketing mix and has very good ideas in how communicators can be using social media better.",
      "private": false
    },
    {
      "name": "Liz Woods - The Awareness Centre, Tooting",
      "flavor": "professional",
      "quote": "Colin effortlessly helps me and my team keep on top of developments in new media; we benefit hugely from his knowledge and expertise.",
      "private": false
    },
    {
      "name": "Tim Lloyd - Helpful Digital and the Social Simulator",
      "flavor": "professional",
      "quote": "Colin is a great colleague. He's driven and bright, and can explain complex technical ideas in a way that is interesting.    I've always found Colin to be reliable and considerate, and a champion of digital engagement in health and the NHS.",
      "private": false
    },
    {
      "name": "Suzanne Ruggles - FULL CIRCLE FUND THERAPIES",
      "flavor": "professional",
      "quote": "Colin established Full Circle Fund's online networking presence for fundraising events at St George's Healthcare Trust.  He's proactive, friendly, efficient and resourceful. Great to have his help and input.",
      "private": false
    },
    {
      "name": "Ali Richards - Acute Frailty",
      "flavor": "professional",
      "quote": "Colin is the moderator for a fantastic and successful chat on twitter, #nhssm. He is a role model of someone who is reaching out to create wider engagement for social media in the healthcare  community. By facilitating an online chat once a week Colin is creating a new community and network of people who can share best practice and support each other in social media.",
      "private": false
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native or bilingual proficiency"
    },
    {
      "language": "SQL",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "Javascript",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "PHP",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "Scala",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "Python",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "CSS",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "HTML",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "Objective-C",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "Java",
      "fluency": "Elementary proficiency"
    },
    {
      "language": "XML",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "JSON",
      "fluency": "Professional working proficiency"
    },
    {
      "language": "C",
      "fluency": "Elementary proficiency"
    },
    {
      "language": "Assembly",
      "fluency": "Elementary proficiency"
    },
    {
      "language": "C++",
      "fluency": "Elementary proficiency"
    },
    {
      "language": "Ruby",
      "fluency": "Elementary proficiency"
    },
    {
      "language": "XSL",
      "fluency": "Limited working proficiency"
    },
    {
      "language": "Bash",
      "fluency": "Limited working proficiency"
    }
  ]
}